import React from "react";
import "./Bonus.css";
import "./Bonus.mobile.css";

const BonusOffer = () => {
  return (
    <div className="bonus-offer-page">
      <div className="bonus-box">
        <h3>🎁 Путівник новачка (бонус+)</h3>
        <p>
          🧑‍🎓 Завантажте наш безкоштовний путівник, щоб дізнатися, як створити
          своє перше портфоліо, навіть якщо у вас ще немає досвіду!
        </p>

        <p>
          В путівнику ви знайдете прості поради, готові шаблони та приклади,
          які допоможуть швидко стартувати та отримати впевненість у своїх
          перших проєктах.
        </p>

        <a 
          href="documents/WebStart_Portfolio_Guide.docx" 
          download 
          className="btn-primary"
        >
          Завантажити путівник
        </a>
      </div>
    </div>
  );
};

export default BonusOffer;

